In [26]:
import numpy as np
import pandas as pd
import matplotlib as plt
from numpy import sqrt, abs, round
from scipy.stats import norm

In [2]:
data = pd.read_csv('E:/DataSets/titanic/train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
data.groupby('Pclass')[['Survived']].sum()

        Survived
Pclass
1            136
2             87
3            119

In [19]:
data.groupby('Pclass')[['Survived']].count()

        Survived
Pclass
1            216
2            184
3            491

In [17]:
data.query('Pclass == 1')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [8]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
data['Survived'].mean()

0.3838383838383838

In [12]:
p1_survived = data[data['Pclass'] == 1]['Survived']
p2_survived = data[data['Pclass'] == 2]['Survived']
p3_survived = data[data['Pclass'] == 3]['Survived']

In [13]:
p1_mean = p1_survived.mean()
p1_mean

0.6296296296296297

In [20]:
p2_mean = p2_survived.mean()
p2_mean

0.47282608695652173

In [21]:
p3_mean = p3_survived.mean()
p3_mean

0.24236252545824846

In [23]:
diff_mean_p1_p2 = p1_mean - p2_mean
diff_mean_p1_p2

0.15680354267310792

In [27]:
diff_mean_p1_p3 = p1_mean - p3_mean
diff_mean_p1_p3

0.3872671041713812

In [28]:
diff_mean_p2_p3 = p2_mean - p3_mean
diff_mean_p2_p3

0.23046356149827327

In [24]:
std_p1 = p1_survived.std()
std_p2 = p2_survived.std()
std_p3 = p3_survived.std()

In [25]:
np1 = len(p1_survived)
np2 = len(p2_survived)
np3 = len(p3_survived)

In [29]:
d_p1_p2 = sqrt((std_p1 ** 2 / np1) + (std_p2 ** 2 / np2))
d_p1_p2

0.04946431467617664

In [30]:
d_p1_p3 = sqrt((std_p1 ** 2 / np1) + (std_p3 ** 2 / np3))
d_p1_p3

0.03820175356191139

In [31]:
d_p2_p3 = sqrt((std_p2 ** 2 / np2) + (std_p3 ** 2 / np3))
d_p1_p2

0.04946431467617664

In [33]:
z_p1_p2 = diff_mean_p1_p2/d_p1_p2
z_p1_p2

3.170033663655079

In [34]:
z_p1_p3 = diff_mean_p1_p3/d_p1_p3
z_p1_p3

10.13741695243805

In [35]:
z_p2_p3 = diff_mean_p2_p3/d_p2_p3
z_p2_p3

5.529987345441649

In [37]:
pvalue_p1_p2 = 2 * (1 - norm.cdf(abs(z_p1_p2)))
pvalue_p1_p2

0.0015242127775378922

In [38]:
pvalue_p1_p3 = 2 * (1 - norm.cdf(abs(z_p1_p3)))
pvalue_p1_p3

0.0

In [39]:
pvalue_p2_p3 = 2 * (1 - norm.cdf(abs(z_p2_p3)))
pvalue_p2_p3

3.202538900737295e-08